{"meta":{"title":"heydu 的小站","subtitle":"","description":"edit for fun!","author":"heydu","url":"https://heyduwuji.github.io/blog","root":"/blog/"},"pages":[{"title":"404","text":"","path":"404/index.html","date":"04-29","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"04-29","excerpt":""}],"posts":[{"title":"diary5.2","text":"今天几乎是什么都没干。上午十点钟才到图书馆自习，花了大概四个小时把微积分作业写完了。然后下午本来打算把高代和物理都写完的。结果没想到高代上来就遇到了一道难题，就卡住了。越想越烦，偏偏座位旁边的人还挺烦人的，于是就越做越烦，干脆就不做了。结果回到宿舍就是摆烂，没办法。。。所以说一个人要想做到包容真的很不容易。晚上喝了大半听的啤酒，现在有点困了。看来真的是不胜酒力呀。明天还得去录高考加油的视频，然而我该说些什么还没有想好。困了，睡觉吧。","path":"2022/05/03/diary5-2/","date":"05-03","excerpt":"","tags":[]},{"title":"diary5.1","text":"从今天开始就记日记吧。五一劳动节快乐！事实上我今天也确实劳动了。洗了积攒了快两周的袜子，刷了从开学到现在就没有刷过的鞋。然而这双鞋已经洗不白了。本来还想着找老妈求助一下，结果就忘了。没准漂白剂会管用。至于作业嘛，今天几乎就是没写。早晨大概九点钟起的床吧，起床之后先去吃了个早饭，然后一直到中午都在写oop的第四次作业的计算图。让我很开心的一点就是这次作业的所有编程题我都是一次过的，很厉害吧。说不定我还挺适合oop的这种编程思想的呢。别奶下午回来就一直刷b站。说真的，b站真的很容易上瘾，所以以后还是有任务的时候千万不要打开b站吧，不管任务紧急不紧急。。。一直到晚上才想起来写一会儿写沟。也不是写，就是光找文献了。数了一下，31篇，还只是今天找的。得找个时间把这么多论文给读完了。还得边读边做笔记。读论文这事讲真得在清醒的时候读，及时发现每一个能用在你的论文中的点或者记录下随时点启发。不然你绝对不会想花时间再读一遍论文的。刚才刷牙的时候突然想到，清华开设写沟课的一大目的是不是就是让大一学生多读几篇知网的中文论文，好回本儿呀！我觉得很有可能诶！事实上现在已经是5月2号的1:09了，我肚子已经开始饿了，想写的东西也全都忘了。存的零食都已经吃完了，好饿。。。睡觉吧。","path":"2022/05/02/diary5-1/","date":"05-02","excerpt":"","tags":[]},{"title":"questionnaire","text":"此文章用于记录设计调查问卷的过程 针对THU大学生学习压力和睡眠质量设计了调查问卷睡眠质量用的是现成的PSQI，学习压力的据说是从知网上的某篇“较为权威的”论文里找来的问题。收集了17个人的问卷，破费了25块（笑）。在问卷星上进行效度分析。事实证明PSQI真的很可靠，因子的相关系数基本都是一致的，只进行了微调。但学习压力的情况就不一样了，十分糟糕。近二十个问题最后删得不到十个，最后总算是让两份问卷的相关系数分属于两个因子了，但KMO很糟糕。网查KMO是一个用于分析多份问卷中因子的一致性的，具体来说应该是分析几个因子之间有没有隐藏的相关性。很糟糕的是我的KMO的值是0.466可以说是比较差了。用exel计算了皮尔森相关性系数，是0.249.百度说低于0.3已经可以身为没有关系了。惨。不知道是因为样本量太小还是因为这俩就没有什么相关性。目前修改之后的问卷有5个问题是关于学习压力的，有8个问题是关于睡眠质量的。如果用这个问卷进行大规模调查的话，问题少倒是一个好处，但也是个弊端，感觉问题少了会使得数据不那么可靠。还有很烦的一点就是我这个问卷的数据提交过一次SPSSAU平台，这导致之后我每一次重新进行该问卷的数据分析都只能到那个平台上去分析，但问题是它收费啊！。但问卷星本身的这个功能是不收费的。就很难顶。还好我提前保存了截图。但尽管如此，我也没办法测试如果我把一些问题重新加回到问卷之后会对效度有一个什么影响。所以我只能重开一个问卷了。。。","path":"2022/04/30/questionnaire/","date":"04-30","excerpt":"","tags":[]},{"title":"文图自习鉴评","text":"文图有单人研讨间，但似乎得提前预约，不知道最长能约多久文图只有二层有单人桌，面向一个小窗户，但两个单人桌之间没有墙（只有某几个位置是被承重的柱子所隔开的），因此不要期望单人桌可以隔音。此外单人桌真的很抢手，早上快十点的时候就已经约满了（尽管我走了一圈发现有三四个空位置，但预约系统还是显示约满了）。无奈之下只能上四楼的自习室。这里的是四个人一个桌子，对面有隔板，旁边没有。但有电源，有灯。但这个灯居然是对向的两个人共用的，开关却是两个人的桌子上都有的，令人匪夷所思的控制设计。 在文图呆了半个上午和一个下午了感觉这里非常不错的就是很安静，真的很适合写论文和写程序。当然对我这类人来说就是干什么都很适合了。此外之前我一直呆在逸夫馆不知道，原来文图里面80%都是小姐姐。之前在逸夫馆的时候以为清华只有男生和敲代码的少数女生了。。。最后，文图是真的漂亮啊。图书馆中间镂空的圆形超级有设计感的，看上去很美观，给人一种很有涵养的感觉。我太喜欢在这里自习了，以至于下午集体锻炼后，经过一番纠结之后还是选择了在五一假期里放弃回宿舍摸鱼，而来文图自习。总的来说灰常不错！","path":"2022/04/30/文图自习鉴评/","date":"04-30","excerpt":"","tags":[]},{"title":"test","text":"testsecond titlehelloworld 1print(&#x27;hello world&#x27;)&#125; 这是引言{ bilicard BV1rS4y1c7tk }","path":"2022/04/28/test/","date":"04-28","excerpt":"","tags":[]},{"title":"my_first_blog","text":"this is my first blog12345#include &lt;iostream&gt;using namespace std;int main()&#123; cout &lt;&lt; &quot;hello world&quot;;&#125;","path":"2022/04/28/my-first-blog/","date":"04-28","excerpt":"","tags":[]},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","path":"2022/04/28/hello-world/","date":"04-28","excerpt":"","tags":[]}],"categories":[],"tags":[]}